/*
Задача 2. Напишете функцията double atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място.
*/
#include<stdio.h>
#include<ctype.h>

double atof();

int main(void){
    char str[] = "345.6789";

    printf("\nThe String: %lf", atof(str));

    return 0;

}

double atof(char str[]){
    double fValue, power;
    int i = 0;
    for(fValue == 0.0; isdigit(str[i]); i++){
        fValue = 10.0 * fValue + (str[i] - '0');
    }

    if(str[i] == '.'){ i++; }

    for(power = 1.0; isdigit(str[i]); i++){
        fValue = 10.0 * fValue + (str[i] - '0');
        power *= 10;
    }

    return fValue/power;
}
