/*
18 Довършете задачата за кемперите от миналия път като добавите
променлива, в която да се събират парите, които клиента дължи на компанията.
Принтирайте резултата. Питайте клиента дали иска още налични продукти.
*/

//Във връзка със задача 10 -->

/*
10. Представете си, че имате фирма за отдаване на каравани и кемпери под
наем, за която трябва да разработите софтуер. Вие сте малка фирма и имате
общо 3 каравани на цена 90 лв. на ден и 3 кемпера на цена 100 лв. на ден.
Декларирайте променливи за броя на караваните, цената на караваните, броя на
кемперите и цената им. Направете меню, което пита клиента каравана или
кемпер ще иска: printf("Dobre doshli v Karavani Kempeti pod naem\n");
printf("Ako zelaete karavana natisnete 1\n");
printf("Ako zelaete kemper natisnete 2\n");
Направете една променлива int rez; , в която да запишем резултатът от неговия
избор.
...
*/

#include <stdio.h>

int main(){


    char caravan = 3;
    char caravanDayRent = 90;
    char kemper = 3;
    char kemperDayRent = 100;

    int rez = 0;
    int rentDays = 0;
    int total = 0;

    printf("\t\tДобре дошли в \"Каравани и Кемпери под наем\". \n\n");

    printf("Ако желаете \"Каравана\" натиснете '1'\n\nАко желаете \"Кемпер\" натиснете '2' \n", &rez);

    scanf("%i", &rez);


    if (rez == 1){
        printf("Вие избрахте \"Каравана\". \n");
        printf("За колко дни желаете да наемете превозното средство? \n");
        scanf("%i", &rentDays);
        total = caravanDayRent * rentDays;
        printf("Вашата крайна сума за плащане е: %i \n", total);

    }
    else if (rez == 2){
        printf("Вие избрахте \"Кемпер\". \n");
        printf("За колко дни желаете да наемете превозното средство? \n");
        scanf("%i", &rentDays);
        total = kemperDayRent * rentDays;
        printf("Вашата крайна сума за плащане е: %i \n", total);
    }
    else{
        printf("Направете валиден избор! \n");
    }

    printf("\nЖелаете ли да се запознаете с други наши продукти? \n");

return 0;
}
