/*
Задача 10. Напишете програма на С, която съдържа 3 функции,
изнесете прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и
да намерите корен квадратен от него.
*/

#include <stdio.h>
//#include <math.h>

int calcLCM();
float absoluteValue();



int main(){



return 0;
}

int calcLCM(int x, int y){
    int index = 1;
    int LCM = 0;
    if (LCM != 0){
    }
    if ( x * index % y == 0){
        LCM = x * index;
    }
    index++;

    return LCM;
}

float absoluteValue(float n){
    abs(n))
    /*n < 0 ? -1.0 : 1.0;*/

return n;
}
