/*
Задача 7.4. Да се изчисли сумата на целите числа в
зададен диапазон [a, b] – използване на цикъл с пред-условие –
оператор while.
*/

#include <stdio.h>

int main(){
    int a = 0;
    int b = 0;
    printf(" Въведете диапазон за пресмятане! \n");
    printf("\n Въведете начало на диапазона: ");
    scanf("%d", &a);
    printf(" Въведете край на диапазона: ");
    scanf("%d", &b);
    int sum = 0;
printf("\n Сборът на цифрите/числата в диапазона от %d до %d е: ", a, b);
    while(a <= b){
        sum = (a * (b + 1)) / 2;
        a++;
    }

    printf("%d \n", sum);
return 0;
}
