/*
Задача 7.8. Създайте безкраен цикъл с for (;;) и принтирайте числото,
което на всеки цикъл се увеличава с едно. Когато числото стигне 48,
излезте от цикъла с break.
*/

#include <stdio.h>

int main(){
    int i = 0;

    for(;;){
        sleep(1);
        //++i;
        i++;
        printf("%d \n", i);

        if(i == 48){
            break;
        }
    }

return 0;
}
