/*
Задача 1.Направете глобална константа pi = 3.14, както правихме в
предишния урок. Напишете функция, която изчислява площта на кръг, на
която като параметър подаваме радиуса и връщаме площта на кръга.
Използвайте глобалната константа pi, за да извършите изчисленията.
Извикайте функцията в main() и покажете резултата.
*/

#include <stdio.h>

const double PI = 3.14159265359;

float calc(float R);

int main (){
    printf ("Rez: %f\n", calc(5));

    return 0;
}

float calc(float R){
    return PI*(R*R);
}
