/*
Задача 1
Напишете функцията void printStr(char *s) аргумент поинтер
към началото на стринга. Използвайте for цикъл и обходете стринга докато
не стигнете знака за на стринг '\0'. На всяка итерация пристирайте всеки
един елемент на стринга с printf("%с", с).
*/

#include <stdio.h>

void printStr(char *s){
    for(int i = 0; s[i] != '\0'; i++){
        printf("%c\n", s[i]);
    }
}

int main(){
    char cArr[] = {'H', 'e', 'l', 'l', '\0', 'o'};

    printStr(cArr);

return 0;
}
