/*
Направете програма за изчисляване на баркод UPC(Universal Product Code)
Производителите на стоки от години поставят баркодове на своите продукти. Всеки баркод представлява 12 числа:
Първото число е типа на продукта
Лявата група числа представят производителя,
Дясната група числа представят продукта
Последното число е за проверка.

0 13800 15173 5

Ето алгоритъма за изчисление на проверката за грешка:
Съберете нечетните числа: първото, третото, петото и т.н.
Съберете четните числа: второто, четвъртото и т.н
Умножете първата сума по 3 и добавете втората сума.
Извадете 1 от тотала
Делите тотала по модул на 10.
Изваждате резултата от 9 и трябва да получите последната цифра.
*/

#include <stdio.h>

int main(){
    int f0, c1, c2, c3, c4, c5, d1, d2, d3, d4, d5;
    int totalOdd, totalEven, total, checkSum;

        printf("Моля въведете цифрите на UPC кода за проверка\nпо еденично!\n");

    printf("\nВъведете първата цифра: ");
        scanf("%i", &f0);
    printf("Въведете втората цифра: ");
        scanf("%i", &c1);
    printf("Въведете третата цифра: ");
        scanf("%i", &c2);
    printf("Въведете четвъртата цифра: ");
        scanf("%i", &c3);
    printf("Въведете петата цифра: ");
        scanf("%i", &c4);
    printf("Въведете шестата цифра: ");
        scanf("%i", &c5);
    printf("Въведете седмата цифра: ");
        scanf("%i", &d1);
    printf("Въведете осмата цифра: ");
        scanf("%i", &d2);
    printf("Въведете деветата цифра: ");
        scanf("%i", &d3);
    printf("Въведете десетата цифра: ");
        scanf("%i", &d4);
    printf("Въведете единадесетата цифра: ");
        scanf("%i", &d5);

    totalOdd = f0 + c2 + c4 + d1 + d3 + d5;
    totalEven = c1 + c3 + c5 + d2 + d4;

    total = 3 * totalOdd + totalEven;

    checkSum = (9 - ((total - 1) % 10));

    printf("\nКонтролната цифра за този UPC коде е: %d \n", checkSum);



return 0;
}
